RT-Thread/rt-thread/bsp/freescale/platform/devices/MK63F12/include/MK63F12_extension.h
/*
 * Constants & macros for individual ENET_RCR bitfields
 */

/*!
 * @name Register ENET_RCR, field LOOP[0] (RW)
 *
 * This is an MII internal loopback, therefore MII_MODE must be written to 1 and
 * RMII_MODE must be written to 0.
 *
 * Values:
 * - 0b0 - Loopback disabled.
 * - 0b1 - Transmitted frames are looped back internal to the device and
 *     transmit MII output signals are not asserted. DRT must be cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_RCR_LOOP field. */
#define ENET_RD_RCR_LOOP(base) ((ENET_RCR_REG(base) & ENET_RCR_LOOP_MASK) >> ENET_RCR_LOOP_SHIFT)
#define ENET_BRD_RCR_LOOP(base) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_LOOP_SHIFT))

/*! @brief Set the LOOP field to a new value. */
#define ENET_WR_RCR_LOOP(base, value) (ENET_RMW_RCR(base, ENET_RCR_LOOP_MASK, ENET_RCR_LOOP(value)))
#define ENET_BWR_RCR_LOOP(base, value) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_LOOP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_RCR, field DRT[1] (RW)
 *
 * Values:
 * - 0b0 - Receive path operates independently of transmit. Used for full-duplex
 *     or to monitor transmit activity in half-duplex mode.
 * - 0b1 - Disable reception of frames while transmitting. Normally used for
 *     half-duplex mode.
 */
/*@{*/
/*! @brief Read current value of the ENET_RCR_DRT field. */
#define ENET_RD_RCR_DRT(base) ((ENET_RCR_REG(base) & ENET_RCR_DRT_MASK) >> ENET_RCR_DRT_SHIFT)
#define ENET_BRD_RCR_DRT(base) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_DRT_SHIFT))

/*! @brief Set the DRT field to a new value. */
#define ENET_WR_RCR_DRT(base, value) (ENET_RMW_RCR(base, ENET_RCR_DRT_MASK, ENET_RCR_DRT(value)))
#define ENET_BWR_RCR_DRT(base, value) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_DRT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_RCR, field MII_MODE[2] (RW)
 *
 * This field must always be set.
 *
 * Values:
 * - 0b0 - Reserved.
 * - 0b1 - MII or RMII mode, as indicated by the RMII_MODE field.
 */
/*@{*/
/*! @brief Read current value of the ENET_RCR_MII_MODE field. */
#define ENET_RD_RCR_MII_MODE(base) ((ENET_RCR_REG(base) & ENET_RCR_MII_MODE_MASK) >> ENET_RCR_MII_MODE_SHIFT)
#define ENET_BRD_RCR_MII_MODE(base) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_MII_MODE_SHIFT))

/*! @brief Set the MII_MODE field to a new value. */
#define ENET_WR_RCR_MII_MODE(base, value) (ENET_RMW_RCR(base, ENET_RCR_MII_MODE_MASK, ENET_RCR_MII_MODE(value)))
#define ENET_BWR_RCR_MII_MODE(base, value) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_MII_MODE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_RCR, field PROM[3] (RW)
 *
 * All frames are accepted regardless of address matching.
 *
 * Values:
 * - 0b0 - Disabled.
 * - 0b1 - Enabled.
 */
/*@{*/
/*! @brief Read current value of the ENET_RCR_PROM field. */
#define ENET_RD_RCR_PROM(base) ((ENET_RCR_REG(base) & ENET_RCR_PROM_MASK) >> ENET_RCR_PROM_SHIFT)
#define ENET_BRD_RCR_PROM(base) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_PROM_SHIFT))

/*! @brief Set the PROM field to a new value. */
#define ENET_WR_RCR_PROM(base, value) (ENET_RMW_RCR(base, ENET_RCR_PROM_MASK, ENET_RCR_PROM(value)))
#define ENET_BWR_RCR_PROM(base, value) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_PROM_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_RCR, field BC_REJ[4] (RW)
 *
 * If set, frames with destination address (DA) equal to 0xFFFF_FFFF_FFFF are
 * rejected unless the PROM field is set. If BC_REJ and PROM are set, frames with
 * broadcast DA are accepted and the MISS (M) is set in the receive buffer
 * descriptor.
 */
/*@{*/
/*! @brief Read current value of the ENET_RCR_BC_REJ field. */
#define ENET_RD_RCR_BC_REJ(base) ((ENET_RCR_REG(base) & ENET_RCR_BC_REJ_MASK) >> ENET_RCR_BC_REJ_SHIFT)
#define ENET_BRD_RCR_BC_REJ(base) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_BC_REJ_SHIFT))

/*! @brief Set the BC_REJ field to a new value. */
#define ENET_WR_RCR_BC_REJ(base, value) (ENET_RMW_RCR(base, ENET_RCR_BC_REJ_MASK, ENET_RCR_BC_REJ(value)))
#define ENET_BWR_RCR_BC_REJ(base, value) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_BC_REJ_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_RCR, field FCE[5] (RW)
 *
 * If set, the receiver detects PAUSE frames. Upon PAUSE frame detection, the
 * transmitter stops transmitting data frames for a given duration.
 */
/*@{*/
/*! @brief Read current value of the ENET_RCR_FCE field. */
#define ENET_RD_RCR_FCE(base) ((ENET_RCR_REG(base) & ENET_RCR_FCE_MASK) >> ENET_RCR_FCE_SHIFT)
#define ENET_BRD_RCR_FCE(base) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_FCE_SHIFT))

/*! @brief Set the FCE field to a new value. */
#define ENET_WR_RCR_FCE(base, value) (ENET_RMW_RCR(base, ENET_RCR_FCE_MASK, ENET_RCR_FCE(value)))
#define ENET_BWR_RCR_FCE(base, value) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_FCE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_RCR, field RMII_MODE[8] (RW)
 *
 * Specifies whether the MAC is configured for MII mode or RMII operation .
 *
 * Values:
 * - 0b0 - MAC configured for MII mode.
 * - 0b1 - MAC configured for RMII operation.
 */
/*@{*/
/*! @brief Read current value of the ENET_RCR_RMII_MODE field. */
#define ENET_RD_RCR_RMII_MODE(base) ((ENET_RCR_REG(base) & ENET_RCR_RMII_MODE_MASK) >> ENET_RCR_RMII_MODE_SHIFT)
#define ENET_BRD_RCR_RMII_MODE(base) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_RMII_MODE_SHIFT))

/*! @brief Set the RMII_MODE field to a new value. */
#define ENET_WR_RCR_RMII_MODE(base, value) (ENET_RMW_RCR(base, ENET_RCR_RMII_MODE_MASK, ENET_RCR_RMII_MODE(value)))
#define ENET_BWR_RCR_RMII_MODE(base, value) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_RMII_MODE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_RCR, field RMII_10T[9] (RW)
 *
 * Enables 10-Mbps mode of the RMII .
 *
 * Values:
 * - 0b0 - 100 Mbps operation.
 * - 0b1 - 10 Mbps operation.
 */
/*@{*/
/*! @brief Read current value of the ENET_RCR_RMII_10T field. */
#define ENET_RD_RCR_RMII_10T(base) ((ENET_RCR_REG(base) & ENET_RCR_RMII_10T_MASK) >> ENET_RCR_RMII_10T_SHIFT)
#define ENET_BRD_RCR_RMII_10T(base) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_RMII_10T_SHIFT))

/*! @brief Set the RMII_10T field to a new value. */
#define ENET_WR_RCR_RMII_10T(base, value) (ENET_RMW_RCR(base, ENET_RCR_RMII_10T_MASK, ENET_RCR_RMII_10T(value)))
#define ENET_BWR_RCR_RMII_10T(base, value) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_RMII_10T_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_RCR, field PADEN[12] (RW)
 *
 * Specifies whether the MAC removes padding from received frames.
 *
 * Values:
 * - 0b0 - No padding is removed on receive by the MAC.
 * - 0b1 - Padding is removed from received frames.
 */
/*@{*/
/*! @brief Read current value of the ENET_RCR_PADEN field. */
#define ENET_RD_RCR_PADEN(base) ((ENET_RCR_REG(base) & ENET_RCR_PADEN_MASK) >> ENET_RCR_PADEN_SHIFT)
#define ENET_BRD_RCR_PADEN(base) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_PADEN_SHIFT))

