RT-Thread/rt-thread/bsp/freescale/platform/devices/MK63F12/include/MK63F12_extension.h
/*! @brief Set the STAT_SECTION_EMPTY field to a new value. */
#define ENET_WR_RSEM_STAT_SECTION_EMPTY(base, value) (ENET_RMW_RSEM(base, ENET_RSEM_STAT_SECTION_EMPTY_MASK, ENET_RSEM_STAT_SECTION_EMPTY(value)))
#define ENET_BWR_RSEM_STAT_SECTION_EMPTY(base, value) (ENET_WR_RSEM_STAT_SECTION_EMPTY(base, value))
/*@}*/

/*******************************************************************************
 * ENET_RAEM - Receive FIFO Almost Empty Threshold
 ******************************************************************************/

/*!
 * @brief ENET_RAEM - Receive FIFO Almost Empty Threshold (RW)
 *
 * Reset value: 0x00000004U
 */
/*!
 * @name Constants and macros for entire ENET_RAEM register
 */
/*@{*/
#define ENET_RD_RAEM(base)       (ENET_RAEM_REG(base))
#define ENET_WR_RAEM(base, value) (ENET_RAEM_REG(base) = (value))
#define ENET_RMW_RAEM(base, mask, value) (ENET_WR_RAEM(base, (ENET_RD_RAEM(base) & ~(mask)) | (value)))
#define ENET_SET_RAEM(base, value) (ENET_WR_RAEM(base, ENET_RD_RAEM(base) |  (value)))
#define ENET_CLR_RAEM(base, value) (ENET_WR_RAEM(base, ENET_RD_RAEM(base) & ~(value)))
#define ENET_TOG_RAEM(base, value) (ENET_WR_RAEM(base, ENET_RD_RAEM(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RAEM bitfields
 */

/*!
 * @name Register ENET_RAEM, field RX_ALMOST_EMPTY[7:0] (RW)
 *
 * Value, in 64-bit words, of the receive FIFO almost empty threshold. When the
 * FIFO level reaches the value programmed in this field and the end-of-frame has
 * not been received for the frame yet, the core receive read control stops FIFO
 * read (and subsequently stops transferring data to the MAC client
 * application). It continues to deliver the frame, if again more data than the threshold or
 * the end-of-frame is available in the FIFO. A minimum value of 4 should be set.
 */
/*@{*/
/*! @brief Read current value of the ENET_RAEM_RX_ALMOST_EMPTY field. */
#define ENET_RD_RAEM_RX_ALMOST_EMPTY(base) ((ENET_RAEM_REG(base) & ENET_RAEM_RX_ALMOST_EMPTY_MASK) >> ENET_RAEM_RX_ALMOST_EMPTY_SHIFT)
#define ENET_BRD_RAEM_RX_ALMOST_EMPTY(base) (ENET_RD_RAEM_RX_ALMOST_EMPTY(base))

/*! @brief Set the RX_ALMOST_EMPTY field to a new value. */
#define ENET_WR_RAEM_RX_ALMOST_EMPTY(base, value) (ENET_RMW_RAEM(base, ENET_RAEM_RX_ALMOST_EMPTY_MASK, ENET_RAEM_RX_ALMOST_EMPTY(value)))
#define ENET_BWR_RAEM_RX_ALMOST_EMPTY(base, value) (ENET_WR_RAEM_RX_ALMOST_EMPTY(base, value))
/*@}*/

/*******************************************************************************
 * ENET_RAFL - Receive FIFO Almost Full Threshold
 ******************************************************************************/

/*!
 * @brief ENET_RAFL - Receive FIFO Almost Full Threshold (RW)
 *
 * Reset value: 0x00000004U
 */
/*!
 * @name Constants and macros for entire ENET_RAFL register
 */
/*@{*/
#define ENET_RD_RAFL(base)       (ENET_RAFL_REG(base))
#define ENET_WR_RAFL(base, value) (ENET_RAFL_REG(base) = (value))
#define ENET_RMW_RAFL(base, mask, value) (ENET_WR_RAFL(base, (ENET_RD_RAFL(base) & ~(mask)) | (value)))
#define ENET_SET_RAFL(base, value) (ENET_WR_RAFL(base, ENET_RD_RAFL(base) |  (value)))
#define ENET_CLR_RAFL(base, value) (ENET_WR_RAFL(base, ENET_RD_RAFL(base) & ~(value)))
#define ENET_TOG_RAFL(base, value) (ENET_WR_RAFL(base, ENET_RD_RAFL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RAFL bitfields
 */

/*!
 * @name Register ENET_RAFL, field RX_ALMOST_FULL[7:0] (RW)
 *
 * Value, in 64-bit words, of the receive FIFO almost full threshold. When the
 * FIFO level comes close to the maximum, so that there is no more space for at
 * least RX_ALMOST_FULL number of words, the MAC stops writing data in the FIFO and
 * truncates the received frame to avoid FIFO overflow. The corresponding error
 * status will be set when the frame is delivered to the application. A minimum
 * value of 4 should be set.
 */
/*@{*/
/*! @brief Read current value of the ENET_RAFL_RX_ALMOST_FULL field. */
#define ENET_RD_RAFL_RX_ALMOST_FULL(base) ((ENET_RAFL_REG(base) & ENET_RAFL_RX_ALMOST_FULL_MASK) >> ENET_RAFL_RX_ALMOST_FULL_SHIFT)
#define ENET_BRD_RAFL_RX_ALMOST_FULL(base) (ENET_RD_RAFL_RX_ALMOST_FULL(base))

/*! @brief Set the RX_ALMOST_FULL field to a new value. */
#define ENET_WR_RAFL_RX_ALMOST_FULL(base, value) (ENET_RMW_RAFL(base, ENET_RAFL_RX_ALMOST_FULL_MASK, ENET_RAFL_RX_ALMOST_FULL(value)))
#define ENET_BWR_RAFL_RX_ALMOST_FULL(base, value) (ENET_WR_RAFL_RX_ALMOST_FULL(base, value))
/*@}*/

/*******************************************************************************
 * ENET_TSEM - Transmit FIFO Section Empty Threshold
 ******************************************************************************/

/*!
 * @brief ENET_TSEM - Transmit FIFO Section Empty Threshold (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_TSEM register
 */
/*@{*/
#define ENET_RD_TSEM(base)       (ENET_TSEM_REG(base))
#define ENET_WR_TSEM(base, value) (ENET_TSEM_REG(base) = (value))
#define ENET_RMW_TSEM(base, mask, value) (ENET_WR_TSEM(base, (ENET_RD_TSEM(base) & ~(mask)) | (value)))
#define ENET_SET_TSEM(base, value) (ENET_WR_TSEM(base, ENET_RD_TSEM(base) |  (value)))
#define ENET_CLR_TSEM(base, value) (ENET_WR_TSEM(base, ENET_RD_TSEM(base) & ~(value)))
#define ENET_TOG_TSEM(base, value) (ENET_WR_TSEM(base, ENET_RD_TSEM(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_TSEM bitfields
 */

/*!
 * @name Register ENET_TSEM, field TX_SECTION_EMPTY[7:0] (RW)
 *
 * Value, in 64-bit words, of the transmit FIFO section empty threshold. See
 * Transmit FIFOFour programmable thresholds are available which control the core
 * operation. for more information.
 */
/*@{*/
/*! @brief Read current value of the ENET_TSEM_TX_SECTION_EMPTY field. */
#define ENET_RD_TSEM_TX_SECTION_EMPTY(base) ((ENET_TSEM_REG(base) & ENET_TSEM_TX_SECTION_EMPTY_MASK) >> ENET_TSEM_TX_SECTION_EMPTY_SHIFT)
#define ENET_BRD_TSEM_TX_SECTION_EMPTY(base) (ENET_RD_TSEM_TX_SECTION_EMPTY(base))

/*! @brief Set the TX_SECTION_EMPTY field to a new value. */
#define ENET_WR_TSEM_TX_SECTION_EMPTY(base, value) (ENET_RMW_TSEM(base, ENET_TSEM_TX_SECTION_EMPTY_MASK, ENET_TSEM_TX_SECTION_EMPTY(value)))
#define ENET_BWR_TSEM_TX_SECTION_EMPTY(base, value) (ENET_WR_TSEM_TX_SECTION_EMPTY(base, value))
/*@}*/

