RT-Thread/rt-thread/bsp/freescale/platform/devices/MK63F12/include/MK63F12_extension.h
/*******************************************************************************
 * ENET_TAEM - Transmit FIFO Almost Empty Threshold
 ******************************************************************************/

/*!
 * @brief ENET_TAEM - Transmit FIFO Almost Empty Threshold (RW)
 *
 * Reset value: 0x00000004U
 */
/*!
 * @name Constants and macros for entire ENET_TAEM register
 */
/*@{*/
#define ENET_RD_TAEM(base)       (ENET_TAEM_REG(base))
#define ENET_WR_TAEM(base, value) (ENET_TAEM_REG(base) = (value))
#define ENET_RMW_TAEM(base, mask, value) (ENET_WR_TAEM(base, (ENET_RD_TAEM(base) & ~(mask)) | (value)))
#define ENET_SET_TAEM(base, value) (ENET_WR_TAEM(base, ENET_RD_TAEM(base) |  (value)))
#define ENET_CLR_TAEM(base, value) (ENET_WR_TAEM(base, ENET_RD_TAEM(base) & ~(value)))
#define ENET_TOG_TAEM(base, value) (ENET_WR_TAEM(base, ENET_RD_TAEM(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_TAEM bitfields
 */

/*!
 * @name Register ENET_TAEM, field TX_ALMOST_EMPTY[7:0] (RW)
 *
 * Value, in 64-bit words, of the transmit FIFO almost empty threshold. When the
 * FIFO level reaches the value programmed in this field, and no end-of-frame is
 * available for the frame, the MAC transmit logic, to avoid FIFO underflow,
 * stops reading the FIFO and transmits a frame with an MII error indication. See
 * Transmit FIFOFour programmable thresholds are available which control the core
 * operation. for more information. A minimum value of 4 should be set.
 */
/*@{*/
/*! @brief Read current value of the ENET_TAEM_TX_ALMOST_EMPTY field. */
#define ENET_RD_TAEM_TX_ALMOST_EMPTY(base) ((ENET_TAEM_REG(base) & ENET_TAEM_TX_ALMOST_EMPTY_MASK) >> ENET_TAEM_TX_ALMOST_EMPTY_SHIFT)
#define ENET_BRD_TAEM_TX_ALMOST_EMPTY(base) (ENET_RD_TAEM_TX_ALMOST_EMPTY(base))

/*! @brief Set the TX_ALMOST_EMPTY field to a new value. */
#define ENET_WR_TAEM_TX_ALMOST_EMPTY(base, value) (ENET_RMW_TAEM(base, ENET_TAEM_TX_ALMOST_EMPTY_MASK, ENET_TAEM_TX_ALMOST_EMPTY(value)))
#define ENET_BWR_TAEM_TX_ALMOST_EMPTY(base, value) (ENET_WR_TAEM_TX_ALMOST_EMPTY(base, value))
/*@}*/

/*******************************************************************************
 * ENET_TAFL - Transmit FIFO Almost Full Threshold
 ******************************************************************************/

/*!
 * @brief ENET_TAFL - Transmit FIFO Almost Full Threshold (RW)
 *
 * Reset value: 0x00000008U
 */
/*!
 * @name Constants and macros for entire ENET_TAFL register
 */
/*@{*/
#define ENET_RD_TAFL(base)       (ENET_TAFL_REG(base))
#define ENET_WR_TAFL(base, value) (ENET_TAFL_REG(base) = (value))
#define ENET_RMW_TAFL(base, mask, value) (ENET_WR_TAFL(base, (ENET_RD_TAFL(base) & ~(mask)) | (value)))
#define ENET_SET_TAFL(base, value) (ENET_WR_TAFL(base, ENET_RD_TAFL(base) |  (value)))
#define ENET_CLR_TAFL(base, value) (ENET_WR_TAFL(base, ENET_RD_TAFL(base) & ~(value)))
#define ENET_TOG_TAFL(base, value) (ENET_WR_TAFL(base, ENET_RD_TAFL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_TAFL bitfields
 */

/*!
 * @name Register ENET_TAFL, field TX_ALMOST_FULL[7:0] (RW)
 *
 * Value, in 64-bit words, of the transmit FIFO almost full threshold. A minimum
 * value of six is required . A recommended value of at least 8 should be set
 * allowing a latency of two clock cycles to the application. If more latency is
 * required the value can be increased as necessary (latency = TAFL - 5). When the
 * FIFO level comes close to the maximum, so that there is no more space for at
 * least TX_ALMOST_FULL number of words, the pin ff_tx_rdy is deasserted. If the
 * application does not react on this signal, the FIFO write control logic, to
 * avoid FIFO overflow, truncates the current frame and sets the error status. As a
 * result, the frame will be transmitted with an GMII/MII error indication. See
 * Transmit FIFOFour programmable thresholds are available which control the core
 * operation. for more information. A FIFO overflow is a fatal error and requires
 * a global reset on the transmit datapath or at least deassertion of ETHEREN.
 */
/*@{*/
/*! @brief Read current value of the ENET_TAFL_TX_ALMOST_FULL field. */
#define ENET_RD_TAFL_TX_ALMOST_FULL(base) ((ENET_TAFL_REG(base) & ENET_TAFL_TX_ALMOST_FULL_MASK) >> ENET_TAFL_TX_ALMOST_FULL_SHIFT)
#define ENET_BRD_TAFL_TX_ALMOST_FULL(base) (ENET_RD_TAFL_TX_ALMOST_FULL(base))

/*! @brief Set the TX_ALMOST_FULL field to a new value. */
#define ENET_WR_TAFL_TX_ALMOST_FULL(base, value) (ENET_RMW_TAFL(base, ENET_TAFL_TX_ALMOST_FULL_MASK, ENET_TAFL_TX_ALMOST_FULL(value)))
#define ENET_BWR_TAFL_TX_ALMOST_FULL(base, value) (ENET_WR_TAFL_TX_ALMOST_FULL(base, value))
/*@}*/

/*******************************************************************************
 * ENET_TIPG - Transmit Inter-Packet Gap
 ******************************************************************************/

/*!
 * @brief ENET_TIPG - Transmit Inter-Packet Gap (RW)
 *
 * Reset value: 0x0000000CU
 */
/*!
 * @name Constants and macros for entire ENET_TIPG register
 */
/*@{*/
#define ENET_RD_TIPG(base)       (ENET_TIPG_REG(base))
#define ENET_WR_TIPG(base, value) (ENET_TIPG_REG(base) = (value))
#define ENET_RMW_TIPG(base, mask, value) (ENET_WR_TIPG(base, (ENET_RD_TIPG(base) & ~(mask)) | (value)))
#define ENET_SET_TIPG(base, value) (ENET_WR_TIPG(base, ENET_RD_TIPG(base) |  (value)))
#define ENET_CLR_TIPG(base, value) (ENET_WR_TIPG(base, ENET_RD_TIPG(base) & ~(value)))
#define ENET_TOG_TIPG(base, value) (ENET_WR_TIPG(base, ENET_RD_TIPG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_TIPG bitfields
 */

/*!
 * @name Register ENET_TIPG, field IPG[4:0] (RW)
 *
 * Indicates the IPG, in bytes, between transmitted frames. Valid values range
 * from 8 to 27. If value is less than 8, the IPG is 8. If value is greater than
 * 27, the IPG is 27.
 */
/*@{*/
/*! @brief Read current value of the ENET_TIPG_IPG field. */
#define ENET_RD_TIPG_IPG(base) ((ENET_TIPG_REG(base) & ENET_TIPG_IPG_MASK) >> ENET_TIPG_IPG_SHIFT)
#define ENET_BRD_TIPG_IPG(base) (ENET_RD_TIPG_IPG(base))

/*! @brief Set the IPG field to a new value. */
#define ENET_WR_TIPG_IPG(base, value) (ENET_RMW_TIPG(base, ENET_TIPG_IPG_MASK, ENET_TIPG_IPG(value)))
#define ENET_BWR_TIPG_IPG(base, value) (ENET_WR_TIPG_IPG(base, value))
/*@}*/

